Cube/Cube_oscillating/flappingWing/backGroundAndWing/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wallsWing
    {
        type            zeroGradient;
    }
    
    wallsBackGround
    {
         type            zeroGradient;
    }
    
    wallsTop
    {
        type            fixedValue;
        value           uniform 0;
    }

    oversetPatch
    {
        type            overset;
    }
}

// ************************************************************************* //
