Cube/Cube_oscillating/flappingWing/backGroundAndWing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.0005;

vertices
(
    // background vertices
    ( -720.0  -720.0  -20)
    (  720.0  -720.0  -20)
    (  720.0   720.0  -20)
    ( -720.0   720.0  -20)
    ( -720.0  -720.0  120)
    (  720.0  -720.0  120)
    (  720.0   720.0  120)
    ( -720.0   720.0  120)

  
    
 
);

blocks
(
    hex (0 1 2 3 4 5 6 7)  (27 27 1)  simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    
        frontAndBackBackGround
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    

    wallsBackGround
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    
    wallsTop
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
